<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"k8s_dev","backend":"fe4ad545046c0f74780f984204214fa06179cf33463107cabaf3f9c116d5f29f","plan_job_ref":"Job Code tests #41 at https://github.com/Bh-an/EKS-GoWebserver/actions/runs/14626559927","plan_out_hash":"0aa7412a806c58ef8f3f45562042bf4d33f9ff25fb5bb98142ec1ad2a733770e","plan_hash":"1c9971b0ed61294bc1910b4e47f12ac8b36386b568f90cb6ebbf8c722bffafa8","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __k8s_dev__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam.data.aws_iam_policy.ecrpolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "ecrpolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksclusterpolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksclusterpolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.ekscnipolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "ekscnipolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksnodegrouppolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksnodegrouppolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksservicepolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksservicepolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy_document.eks_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]

+           principals {
+               identifiers = [
+                   "eks.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.iam.data.aws_iam_policy_document.nodegroup_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "nodegroup_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.iam.aws_iam_role.cluster_role will be updated in-place
!~  resource "aws_iam_role" "cluster_role" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "eks.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "test-eks-role"
        name                  = "test-eks-role"
        tags                  = {
            "Environment" = "test"
            "Platform"    = "k8s"
        }
#        (11 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.node_group_role will be updated in-place
!~  resource "aws_iam_role" "node_group_role" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "test-node-group-role"
        name                  = "test-node-group-role"
        tags                  = {
            "Environment" = "test"
            "Platform"    = "k8s"
        }
#        (11 unchanged attributes hidden)
    }

  # module.networking.aws_route_table.private will be updated in-place
!~  resource "aws_route_table" "private" {
        id               = "rtb-0b1027075d4f09b93"
!~      route            = [
-           {
-               cidr_block                 = "0.0.0.0/0"
-               nat_gateway_id             = "*********************"
#                (12 unchanged attributes hidden)
            },
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = "*********************"
#                (12 unchanged attributes hidden)
            },
        ]
        tags             = {
            "Environment" = "test"
            "Name"        = "k8s-test-private-route-table"
            "Platform"    = "k8s"
        }
#        (5 unchanged attributes hidden)
    }

  # module.oidc.data.aws_iam_policy_document.aws_cloud_controller_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "aws_cloud_controller_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
+               variable = "oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E:sub"
            }

+           principals {
+               identifiers = [
+                   "arn:aws:iam::774305577388:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E",
                ]
+               type        = "Federated"
            }
        }
    }

  # module.oidc.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = "https://oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E"
    }

  # module.oidc.aws_iam_openid_connect_provider.eks will be updated in-place
!~  resource "aws_iam_openid_connect_provider" "eks" {
        id              = "arn:aws:iam::774305577388:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E"
        tags            = {}
!~      thumbprint_list = [
-           "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.oidc.aws_iam_role.aws_cloud_controller_manager will be updated in-place
!~  resource "aws_iam_role" "aws_cloud_controller_manager" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRoleWithWebIdentity"
-                       Condition = {
-                           StringEquals = {
-                               "oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E:sub" = "**************************************************************"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Federated = "arn:aws:iam::774305577388:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/219F741427C6335EE7EB53BC5857967E"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "test-cloud-controller"
        name                  = "test-cloud-controller"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

Changes to Outputs:
+   load_balancer_controller_role_arn = "arn:aws:iam::774305577388:role/test-cloud-controller"
```
</details>

:memo: Plan generated in [Code tests #41](https://github.com/Bh-an/EKS-GoWebserver/actions/runs/14626559927)